app/controllers/accounts_controller.rb

  def index
    @accounts = Account.all
---
SELECT `accounts`.* FROM `accounts`

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO `accounts` (`particular`, `debit`, `credit`, `customer_id`, `transaction_date`, `created_at`, `updated_at`) VALUES ('Maal liya', 2000.0, 1000.0, 3, '2016-11-04', '2016-11-04 10:10:59.907179', '2016-11-04 10:10:59.907179')

    def set_account
      @account = Account.find(params[:id])
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1

    def set_customer
      @customer = Customer.find params[:id]
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 3 LIMIT 1