app/controllers/balance_enquiries_controller.rb

  def index
    @balance_enquiries = BalanceEnquiry.all.paginate(:page => params[:page], :per_page => 5).order(created_at: :desc)
---
SELECT  `balance_enquiries`.* FROM `balance_enquiries`  ORDER BY `balance_enquiries`.`created_at` DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `balance_enquiries`

  def create
    @balance_enquiry = BalanceEnquiry.new(balance_enquiry_params)

    respond_to do |format|
      if @balance_enquiry.save
---
INSERT INTO `balance_enquiries` (`lena`, `dena`, `balance_date`, `created_at`, `updated_at`) VALUES (200, 100, '2016-10-28', '2016-10-28 06:33:17.047284', '2016-10-28 06:33:17.047284')

    def set_balance_enquiry
      @balance_enquiry = BalanceEnquiry.find(params[:id])
---
SELECT  `balance_enquiries`.* FROM `balance_enquiries` WHERE `balance_enquiries`.`id` = 1 LIMIT 1