app/controllers/customers_controller.rb

SELECT  `customers`.* FROM `customers`  ORDER BY `customers`.`created_at` DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `customers`
---
  def index
    @customers = Customer.paginate(:page => params[:page], :per_page => 5).order(created_at: :desc)

INSERT INTO `customers` (`name`, `address`, `phone`, `email`, `created_at`, `updated_at`) VALUES ('Test', 'test', '8093002918', '', '2016-11-04 09:04:55.642115', '2016-11-04 09:04:55.642115')
---
  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save

UPDATE `customers` SET `phone` = '809300291', `updated_at` = '2016-11-04 09:29:39.678304' WHERE `customers`.`id` = 1
---
  def update
    respond_to do |format|
      if @customer.update(customer_params)

DELETE FROM `customers` WHERE `customers`.`id` = 1
---
  def destroy
    @customer.destroy

SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
---
    def set_customer
      @customer = Customer.find(params[:id])