app/controllers/images_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 15 LIMIT 1
INSERT INTO `images` (`avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `product_id`, `created_at`, `updated_at`) VALUES ('AlbumArtSmall.jpg', 'image/jpeg', 9765, '2015-07-30 18:48:39.099860', 1, '2015-07-30 18:48:39.361298', '2015-07-30 18:48:39.361298')
---
  def create
    params[:image][:product_id] = params[:image][:product]
    @product = Product.find(params[:image][:product_id])
    @image = Image.new(image_params)
    respond_to do |format|
      if @image.save

DELETE FROM `images` WHERE `images`.`id` = 6
---
  def destroy
    @image.destroy

SELECT  `images`.* FROM `images` WHERE `images`.`id` = NULL LIMIT 1
---
    def set_product
      @image = Image.find(params[:id])