app/controllers/products_controller.rb

  def index
    @products = Product.includes(:items, :materials, :prices).search(params[:search]).paginate(:page => params[:page], :per_page => 10).order(created_at: :desc)
---
SELECT  `products`.* FROM `products`  ORDER BY `products`.`created_at` DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `products`
SELECT `items`.* FROM `items` WHERE `items`.`product_id` IN (1)

  def create
    params["product"]["material_ids"] = params["product"]["material_ids"].reject{|i| i==""}
    @product = Product.new(product_params)
    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`product_number`, `name`, `description`, `created_at`, `updated_at`) VALUES (1234, 'Test', 'The basics of Paperclip are quite simple: Declare that your model has an attachment with the has_attached_file method, and give it a name.', '2015-07-31 11:18:19.977986', '2015-07-31 11:18:19.977986')

  def update
    respond_to do |format|
      params["product"]["total_price"] = params["product"]["total_price"].to_f
      if @product.update(product_params)
---
UPDATE `products` SET `name` = 'Beverly Hills1', `updated_at` = '2015-07-31 11:54:41.179431' WHERE `products`.`id` = 15

  def add_image
    # byebug
    @product = Product.find(params[:product_id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = NULL LIMIT 1