app/views/products/index.html.erb

        <td><%= product.description %></td>
        <td><% product.items.pluck(:item_name).each_with_index do |item, index| %>
---
SELECT `items`.`item_name` FROM `items` WHERE `items`.`product_id` = 1