app/views/products/show.html.erb

SELECT `images`.* FROM `images` WHERE `images`.`product_id` = 1
---
  <strong style ="float: left;">Image:</strong>
  <% @product.images.each do |image| %>