app/views/accounts/index.html.erb

SELECT `accounts`.* FROM `accounts`
---
  <tbody>
    <% @customer.accounts.each do |account| %>